Revit 2027 API
BuiltInFailures.ElectricalFailures.PanelMismatchDistSysWhenCircuitAssigned Property
 The selected circuit was added to panel [Element], but the distribution system for the panel does not match the power connector definition on the panel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PanelMismatchDistSysWhenCircuitAssigned { get; }
Public Shared ReadOnly Property PanelMismatchDistSysWhenCircuitAssigned As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PanelMismatchDistSysWhenCircuitAssigned {
	FailureDefinitionId^ get ();
}
static member PanelMismatchDistSysWhenCircuitAssigned : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace